Revit 2027 API
MetallicPaint.MetallicpaintFlecks Property
 The property labeled "Flecks" from the "MetallicPaint" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string MetallicpaintFlecks { get; }
Public Shared ReadOnly Property MetallicpaintFlecks As String
	Get
public:
static property String^ MetallicpaintFlecks {
	String^ get ();
}
static member MetallicpaintFlecks : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "MetallicpaintFlecksType".
See Also
Reference
MetallicPaint Class
Autodesk.Revit.DB.Visual Namespace